;---------------------------(1)
	ldc 208574561
	st 0
	ldc 7;Исследуемое число явно не делится на 2, 3 и 5 - начинаем с 7
	st 1
;---------------------------(2)(3)
1:	ld 0
	st 3
	ldc 0
	st 2
1a:	ld 1
	ld 3
	sub
	st 3
	ld 2
	ldc 1
	add
	st 2
	ld 3
	br 1b
	jmp 2a
1b:	ldc 0
	ld 3
	cmp
	ldc 1
	add
	br 1a
	jmp 3
;---------------------------(4)
2a:	ldc 1
	ld 2
	sub
	br 2
	jmp 4
;---------------------------(5)
2:	ld 2
	st 0
	jmp 1
;---------------------------(6)
3:	ld 1
	ldc 2;Проверяем только нечётные делители
	add
	st 1
	jmp 1
;---------------------------(7)
4:	ld 0
	ret
;результат: 1471